Ran Plan for project: `base` dir: `terraform/base` workspace: `default`

<details><summary>Show Output</summary>

```diff
Upgrading modules...
Downloading git::https://github.com/cloudposse/terraform-aws-tfstate-backend.git?ref=tags/0.17.0 for base_tfstate_backend...
- base_tfstate_backend in .terraform/modules/base_tfstate_backend
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for base_tfstate_backend.base_label...
- base_tfstate_backend.base_label in .terraform/modules/base_tfstate_backend.base_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for base_tfstate_backend.dynamodb_table_label...
- base_tfstate_backend.dynamodb_table_label in .terraform/modules/base_tfstate_backend.dynamodb_table_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for base_tfstate_backend.s3_bucket_label...
- base_tfstate_backend.s3_bucket_label in .terraform/modules/base_tfstate_backend.s3_bucket_label
- chronos-cluster in ../modules/base_cluster
Downloading git::https://github.com/cloudposse/terraform-aws-tfstate-backend.git?ref=tags/0.17.0 for chronos_tfstate_backend...
- chronos_tfstate_backend in .terraform/modules/chronos_tfstate_backend
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for chronos_tfstate_backend.base_label...
- chronos_tfstate_backend.base_label in .terraform/modules/chronos_tfstate_backend.base_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for chronos_tfstate_backend.dynamodb_table_label...
- chronos_tfstate_backend.dynamodb_table_label in .terraform/modules/chronos_tfstate_backend.dynamodb_table_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for chronos_tfstate_backend.s3_bucket_label...
- chronos_tfstate_backend.s3_bucket_label in .terraform/modules/chronos_tfstate_backend.s3_bucket_label
- postgres-cluster in ../modules/postgres_cluster
Downloading git::https://github.com/cloudposse/terraform-aws-tfstate-backend.git?ref=tags/0.17.0 for vault_tfstate_backend...
- vault_tfstate_backend in .terraform/modules/vault_tfstate_backend
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for vault_tfstate_backend.base_label...
- vault_tfstate_backend.base_label in .terraform/modules/vault_tfstate_backend.base_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for vault_tfstate_backend.dynamodb_table_label...
- vault_tfstate_backend.dynamodb_table_label in .terraform/modules/vault_tfstate_backend.dynamodb_table_label
Downloading git::https://github.com/cloudposse/terraform-null-label.git?ref=tags/0.16.0 for vault_tfstate_backend.s3_bucket_label...
- vault_tfstate_backend.s3_bucket_label in .terraform/modules/vault_tfstate_backend.s3_bucket_label

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...
- Downloading plugin for provider "digitalocean" (terraform-providers/digitalocean) 1.22.2...
- Downloading plugin for provider "postgresql" (terraform-providers/postgresql) 1.7.1...
- Downloading plugin for provider "local" (hashicorp/local) 1.4.0...
- Downloading plugin for provider "kubernetes" (hashicorp/kubernetes) 1.13.2...
- Downloading plugin for provider "helm" (hashicorp/helm) 1.3.2...
- Downloading plugin for provider "template" (hashicorp/template) 2.2.0...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...
- Downloading plugin for provider "random" (hashicorp/random) 2.3.0...
- Downloading plugin for provider "time" (hashicorp/time) 0.6.0...


Warning: registry.terraform.io: For users on Terraform 0.13 or greater, this provider has moved to digitalocean/digitalocean. Please update your source in required_providers.


Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

module.postgres-cluster.digitalocean_database_cluster.postgres: Refreshing state... [id=af210007-4612-4cb7-9049-dbd43458d5ce]
module.chronos-cluster.digitalocean_kubernetes_cluster.cluster: Refreshing state... [id=f81ea1a8-838a-4339-bb72-018f36792bb5]
module.postgres-cluster.random_password.password["vault"]: Refreshing state... [id=none]
module.postgres-cluster.random_password.password["grafana"]: Refreshing state... [id=none]
module.base_tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Refreshing state...
module.vault_tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Refreshing state...
module.chronos_tfstate_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=chronos-tfstate-state-lock]
module.chronos_tfstate_backend.data.aws_iam_policy_document.prevent_unencrypted_uploads[0]: Refreshing state...
module.base_tfstate_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=base-tfstate-state-lock]
aws_kms_key.vault: Refreshing state... [id=0803e344-39ad-4afd-b955-0eaddd8e724e]
module.vault_tfstate_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=vault-tfstate-state-lock]
aws_iam_user.vault: Refreshing state... [id=vault]
aws_iam_user_policy.vault: Refreshing state... [id=vault:vault]
module.chronos-cluster.helm_release.traefik: Refreshing state... [id=traefik]
helm_release.grafana: Refreshing state... [id=grafana]
module.vault_tfstate_backend.aws_s3_bucket.default: Refreshing state... [id=vault-tfstate-state]
module.base_tfstate_backend.aws_s3_bucket.default: Refreshing state... [id=base-tfstate-state]
module.chronos_tfstate_backend.aws_s3_bucket.default: Refreshing state... [id=chronos-tfstate-state]
aws_iam_access_key.vault: Refreshing state... [id=AKIAWRJIEASW5EK5PJBQ]
helm_release.team-sync: Refreshing state... [id=team-sync]
module.postgres-cluster.postgresql_role.role["grafana"]: Refreshing state... [id=grafana]
module.postgres-cluster.postgresql_role.role["vault"]: Refreshing state... [id=vault]
module.postgres-cluster.postgresql_database.db["grafana"]: Refreshing state... [id=grafana]
module.postgres-cluster.postgresql_database.db["vault"]: Refreshing state... [id=vault]
helm_release.vault: Refreshing state... [id=vault]
module.chronos-cluster.kubernetes_namespace.cert-manager: Refreshing state... [id=cert-manager]
module.chronos-cluster.kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
kubernetes_secret.vault: Refreshing state... [id=default/vault]
module.chronos-cluster.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.chronos-cluster.helm_release.prometheus: Refreshing state... [id=prometheus]
module.chronos-cluster.helm_release.vault-secret-sync: Refreshing state... [id=vault-secret-sync]
module.chronos-cluster.helm_release.fluentd: Refreshing state... [id=fluentd]
module.postgres-cluster.postgresql_default_privileges.privileges["grafana"]: Refreshing state... [id=grafana_grafana_public_grafana_table]
module.postgres-cluster.postgresql_grant.grant["grafana"]: Refreshing state... [id=grafana_grafana_public_table]
module.postgres-cluster.postgresql_grant.grant["vault"]: Refreshing state... [id=vault_vault_public_table]
module.postgres-cluster.postgresql_default_privileges.privileges["vault"]: Refreshing state... [id=vault_vault_public_vault_table]
module.base_tfstate_backend.aws_s3_bucket_public_access_block.default: Refreshing state... [id=base-tfstate-state]
module.chronos_tfstate_backend.aws_s3_bucket_public_access_block.default: Refreshing state... [id=chronos-tfstate-state]
module.chronos_tfstate_backend.data.template_file.terraform_backend_config: Refreshing state...
module.base_tfstate_backend.data.template_file.terraform_backend_config: Refreshing state...
module.vault_tfstate_backend.data.template_file.terraform_backend_config: Refreshing state...
module.vault_tfstate_backend.aws_s3_bucket_public_access_block.default: Refreshing state... [id=vault-tfstate-state]
module.chronos-cluster.time_sleep.cert-manager-cr: Refreshing state... [id=2020-06-09T01:45:04Z]
module.chronos-cluster.helm_release.pennlabs-wildcard-cert["monitoring"]: Refreshing state... [id=pennlabs-wildcard-cert]
module.chronos-cluster.helm_release.pennlabs-wildcard-cert["default"]: Refreshing state... [id=pennlabs-wildcard-cert]
module.chronos-cluster.helm_release.labs-clusterissuer: Refreshing state... [id=labs-clusterissuer]

Outputs:

cluster_ca_certificate = <sensitive>
endpoint = <sensitive>
token = <sensitive>

[SPLIT] BASE CHANGES UNDER HERE


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # vault_generic_secret.vault-flush["first-year-hub"] will be created
+ resource "vault_generic_secret" "vault-flush" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secrets/production/default/first-year-hub"
    }

  # module.postgres-cluster.postgresql_database.db["first-year-hub"] will be created
+ resource "postgresql_database" "db" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = "first-year-hub"
      + owner             = "first-year-hub"
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

  # module.postgres-cluster.postgresql_default_privileges.privileges["first-year-hub"] will be created
+ resource "postgresql_default_privileges" "privileges" {
      + database    = "first-year-hub"
      + id          = (known after apply)
      + object_type = "table"
      + owner       = "first-year-hub"
      + privileges  = [
          + "DELETE",
          + "INSERT",
          + "REFERENCES",
          + "SELECT",
          + "TRIGGER",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + role        = "first-year-hub"
      + schema      = "public"
    }

  # module.postgres-cluster.postgresql_grant.grant["first-year-hub"] will be created
+ resource "postgresql_grant" "grant" {
      + database          = "first-year-hub"
      + id                = (known after apply)
      + object_type       = "table"
      + privileges        = [
          + "DELETE",
          + "INSERT",
          + "REFERENCES",
          + "SELECT",
          + "TRIGGER",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + role              = "first-year-hub"
      + schema            = "public"
      + with_grant_option = false
    }

  # module.postgres-cluster.postgresql_role.role["first-year-hub"] will be created
+ resource "postgresql_role" "role" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = "first-year-hub"
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

  # module.postgres-cluster.random_password.password["first-year-hub"] will be created
+ resource "random_password" "password" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p base`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.pennlabs.org/lock?id=pennlabs%252Finfrastructure%252Fterraform%252Fbase%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p base`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
